---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotScaleInView
source: html/d02f6725-02fe-3e94-4d41-c1b675afb793.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotScaleInView Property

Can't scale because Move Plane is at a very sharp angle in this view. Change view angle or go to another view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotScaleInView { get; }
```